
#include "Nano_Atmega.h"  // รวมไฟล์ไลบรารี Nano_Atmega.h

long timer  = 0;
void setup() {  
  Nano_RP2();                   // เรียกใช้ฟังก์ชันตั้งค่าพินและการเตรียมเซ็นเซอร์
  setFrontLineColor(1);         // กำหนดให้เส้นที่หุ่นยนต์ต้องติดตามเป็นเส้นสีดำ
  Serial.begin(115200);         // เริ่มการสื่อสาร Serial ด้วยความเร็ว 115200 baud
  setSensorPins((const int[]) {0,1,2,3,4,5,6,7}, 8);  // กำหนดพอร์ตของเซ็นเซอร์ และจำนวนเซ็นเซอร์ (8)
  setCalibrate(2000);                                 // ปรับเทียบเซ็นเซอร์โดยการอ่านค่า 2000 ครั้ง
  setSensorMax((const int[]) {  
    1000, 1000, 1000, 1000,1000,1000,1000,1000       // กำหนดค่าสูงสุดที่อ่านได้จากเซ็นเซอร์
  });
  setSensorMin((const int[]) {  
    300, 400, 400, 400,450,500,400,350              // กำหนดค่าต่ำสุดที่อ่านได้จากเซ็นเซอร์
  });
  wait_SW1();                                       // รอการกดปุ่มเพื่อเริ่มต้นการทำงาน
}

void loop() {  
  lineFollow_PID(20,0.25,0,4);                      // ใช้ PID ในการควบคุมหุ่นยนต์ให้ติดตามเส้นที่กำหนดไว้ด้วยความเร็ว 20
}
